v2206/solver_ADMFoam/multi_gasGenComparison/ADMFoam_chem/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// Viscosity
nu              1e-6;

// Thermal expansion coefficient
beta            3e-03;

// Reference temperature
TRef            300;

// Laminar Prandtl number
Pr              0.7;

// Turbulent Prandtl number
Prt             0.85;

// multiphase testing
phases
(
    liquid
    {
        transportModel Newtonian;
        nu             1e-06;
        rho            1000;
    }

    gas
    {
        transportModel  Newtonian;
        nu              1.8e-8; 
        rho             1.3;
    }
);

sigmas
(   
    (liquid gas) 0.07
);


// testing -----------------------------------------------------------
degassing
{
    //- Madatory
    // boundary walls that promotes inter-phase mass trnasfer
    walls
    {
        "bottom";
        "left";
        "right";
    }

    // solid surface wettability 
    // higher alphaW means smaller contact angle (more wetting)
    // TODO: move in walls entry to set up alphaW for each wall
    // TODO: get an actual model than just (amplifier = 1/alphaW)
    alphaW          1.0;
    // alphaW          0.5;


    //- Optional
    // Henry's coefficient
    H               1e-20;

    // Volume fraction threshold to determine interface for inter-phase mass transfer
    // Interface cells are: 
    // --> alphaInterface <= alpha1 <= (1 - alphaInterface)
    alphaInterface  0.1;

    // DEBUG
    // mDotCoeff        1e-12;
    mDotCoeff        0.01;
}
// -------------------------------------------------------------------



// ************************************************************************* //
