v2206/solver_ADMFoam/multi_gasGenComparison/ADMFoam_chem/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication setFields

touch ADM_chem.foam

# runApplication $(getApplication)

runApplication decomposePar

runParallel $(getApplication)

runApplication reconstructPar

# runParallel -s "reconstruct" redistributePar -reconstruct -latestTime

rm -r proc*


#------------------------------------------------------------------------------
